apache/nuttx/arch/arm/src/common/stm32/stm32_can_m3m4_v1_sock.c
  if (work_available(&priv->pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      stm32can_txavail_work(priv);
    }

  return OK;
}

/****************************************************************************
 * Function: stm32can_ioctl
 *
 * Description:
 *   PHY ioctl command handler
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   cmd  - ioctl command
 *   arg  - Argument accompanying the command
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NETDEV_IOCTL
static int stm32can_netdev_ioctl(struct net_driver_s *dev, int cmd,
                                 unsigned long arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)dev->d_private;
  int                 ret  = OK;

  switch (cmd)
    {
      /* TODO */

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}
#endif /* CONFIG_NETDEV_IOCTL */

/****************************************************************************
 * Name: stm32can_rxinterrupt_work
 *
 * Description:
 *   CAN RX FIFO 0/1 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *   rxmb - The RX mailbox number.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int stm32can_rxinterrupt_work(struct stm32_can_s *priv, int rxmb)
{
  struct can_frame *frame = (struct can_frame *)priv->rxdesc;
  uint32_t          regval;
  int               ret   = OK;

  DEBUGASSERT(priv != NULL);

  if (rxmb == 0)
    {
      stm32can_dumpmbregs(priv, "RX0 interrupt");
    }
  else
    {
      stm32can_dumpmbregs(priv, "RX1 interrupt");
    }

  /* Get the CAN identifier. */

  regval = stm32can_getreg(priv, STM32_CAN_RIR_OFFSET(rxmb));

#ifdef CONFIG_NET_CAN_EXTID
  if ((regval & CAN_RIR_IDE) != 0)
    {
      frame->can_id  = (regval & CAN_RIR_EXID_MASK) >> CAN_RIR_EXID_SHIFT;
      frame->can_id |= CAN_EFF_FLAG;
    }
  else
    {
      frame->can_id  = (regval & CAN_RIR_STID_MASK) >> CAN_RIR_STID_SHIFT;
    }
#else
  if ((regval & CAN_RIR_IDE) != 0)
    {
      nerr("ERROR: Received message with extended identifier.  Dropped\n");
      ret = -ENOSYS;
      goto errout;
    }

  frame->can_id = (regval & CAN_RIR_STID_MASK) >> CAN_RIR_STID_SHIFT;
#endif

  /* Extract the RTR bit */

  if ((regval & CAN_RIR_RTR) != 0)
    {
      frame->can_id |= CAN_RTR_FLAG;
    }

  /* Get the DLC */

  regval        = stm32can_getreg(priv, STM32_CAN_RDTR_OFFSET(rxmb));
  frame->can_dlc = (regval & CAN_RDTR_DLC_MASK) >> CAN_RDTR_DLC_SHIFT;

  /* Save the message data */

  regval  = stm32can_getreg(priv, STM32_CAN_RDLR_OFFSET(rxmb));
  frame->data[0] = (regval & CAN_RDLR_DATA0_MASK) >> CAN_RDLR_DATA0_SHIFT;
  frame->data[1] = (regval & CAN_RDLR_DATA1_MASK) >> CAN_RDLR_DATA1_SHIFT;
  frame->data[2] = (regval & CAN_RDLR_DATA2_MASK) >> CAN_RDLR_DATA2_SHIFT;
  frame->data[3] = (regval & CAN_RDLR_DATA3_MASK) >> CAN_RDLR_DATA3_SHIFT;

  regval  = stm32can_getreg(priv, STM32_CAN_RDHR_OFFSET(rxmb));
  frame->data[4] = (regval & CAN_RDHR_DATA4_MASK) >> CAN_RDHR_DATA4_SHIFT;
  frame->data[5] = (regval & CAN_RDHR_DATA5_MASK) >> CAN_RDHR_DATA5_SHIFT;
  frame->data[6] = (regval & CAN_RDHR_DATA6_MASK) >> CAN_RDHR_DATA6_SHIFT;
  frame->data[7] = (regval & CAN_RDHR_DATA7_MASK) >> CAN_RDHR_DATA7_SHIFT;

  /* Copy the buffer pointer to priv->dev..  Set amount of data
   * in priv->dev.d_len
   */

  priv->dev.d_len = sizeof(struct can_frame);
  priv->dev.d_buf = (uint8_t *)frame;

  /* Send to socket interface */

  NETDEV_RXPACKETS(&priv->dev);

  can_input(&priv->dev);

  /* Point the packet buffer back to the next Tx buffer that will be
   * used during the next write.  If the write queue is full, then
   * this will point at an active buffer, which must not be written
   * to.  This is OK because devif_poll won't be called unless the
   * queue is not full.
   */

  priv->dev.d_buf = (uint8_t *)priv->txdesc;

  /* Release the FIFO */

#ifndef CONFIG_NET_CAN_EXTID
errout:
#endif
  regval  = stm32can_getreg(priv, STM32_CAN_RFR_OFFSET(rxmb));
  regval |= CAN_RFR_RFOM;
  stm32can_putreg(priv, STM32_CAN_RFR_OFFSET(rxmb), regval);

  /* Re-enable CAN RX interrupts */

  if (rxmb == 0)
    {
      stm32can_rx0int(priv, true);
    }
  else if (rxmb == 1)
    {
      stm32can_rx1int(priv, true);
    }
  else
    {
      DEBUGPANIC();
    }

  return ret;
}

/****************************************************************************
 * Name: stm32can_rx0interrupt_work
 ****************************************************************************/

static void stm32can_rx0interrupt_work(void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;
  stm32can_rxinterrupt_work(priv, 0);
}

/****************************************************************************
 * Name: stm32can_rx1interrupt_work
 ****************************************************************************/

static void stm32can_rx1interrupt_work(void *arg)
{
  struct stm32_can_s *priv = (struct stm32_can_s *)arg;
  stm32can_rxinterrupt_work(priv, 1);
}

/****************************************************************************
 * Name: stm32can_rxinterrupt
 *
 * Description:
 *   CAN RX FIFO common interrupt handler
 *
 ****************************************************************************/

static int stm32can_rxinterrupt(struct stm32_can_s *priv, int rxmb)
{
  uint32_t regval   = 0;
  int      npending = 0;

  /* Verify that a message is pending in the FIFO */

  regval   = stm32can_getreg(priv, STM32_CAN_RFR_OFFSET(rxmb));
  npending = (regval & CAN_RFR_FMP_MASK) >> CAN_RFR_FMP_SHIFT;
  if (npending < 1)
    {
      nwarn("WARNING: No messages pending\n");
      return OK;
    }

  /* Disable further CAN RX interrupts and schedule to perform the
   * interrupt processing on the worker thread
   */

  if (rxmb == 0)
    {
      stm32can_rx0int(priv, false);
      work_queue(CANWORK, &priv->irqwork,
                 stm32can_rx0interrupt_work, priv, 0);
    }
  else if (rxmb == 1)
    {
      stm32can_rx1int(priv, false);
      work_queue(CANWORK, &priv->irqwork,
                 stm32can_rx1interrupt_work, priv, 0);
    }
  else
    {
      DEBUGPANIC();
    }

  return OK;
}

/****************************************************************************
 * Name: stm32can_rx0interrupt
 *
 * Description:
 *   CAN RX FIFO 0 interrupt handler
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

